<a href="https://colab.research.google.com/github/JayDock/My-journey-to-Machine-Learning/blob/main/Pandas%2C_DataFrames%2C_DataSeries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
#creating a dataframe
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index = ['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns = ['Column1','Column2', 'Column3', 'Column4'])

In [4]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [25]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [26]:
type(df[['Column1','Column2']])

pandas.core.frame.DataFrame

In [6]:
type(df)

pandas.core.frame.DataFrame

For accessing elements there are two ways:

1. loc()

2. iloc()

In [7]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [8]:
type(df.loc['Row1'])

pandas.core.series.Series

in the above example ,it is a series this is because series can be either one row or one column
DataFrame is a combination of many many rows and columns.Atleast it should be greater then one column and atleast it should be greater than one column..

In [9]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [12]:
df.iloc[0:3,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [13]:
df.iloc[0:2,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [14]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:2,0:1]

      Column1
Row1        0
Row2        4

In [16]:
type(df.iloc[0:2,0:1])

pandas.core.frame.DataFrame

In [17]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

# **Converting dataframes to array**

In [19]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

# **To check whether column contains null values**

In [21]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

# **To find out the unit categories in a column**

In [23]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64